Autodesk.Revit.UI.ButtonData.Image
The image of the button.
Remarks: The image will be shown on the button if it is a part of a stacked set, or if it is promoted to the
Quick Access Toolbar. The best size is 16 x 16 pixels; if larger, the image will NOT be adjusted to fit the
toolbar button.

Autodesk.Revit.UI.ButtonData.LargeImage
The large image of the button.
Remarks: The image will be shown on the button in the Ribbon panel if the button is not a part of a stacked set.
It will also be shown on a push button added to a pulldown button. The best size is 32 x 32 pixels; if larger,
the image will be adjusted to fit the button.

Autodesk.Revit.UI.ButtonData.Text
The user-visible text of the button.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when setting the value to null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when setting the value to an empty string,
or when the value contains invalid characters.

Autodesk.Revit.UI.ButtonData
Base class used to contain information necessary to construct a button in the Ribbon.